Week5/rails-planets/app/controllers/planets_controller.rb

INSERT INTO "planets" ("name", "image", "orbit", "diameter", "mass", "moons") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sdfsdfs"], ["image", "sdgs"], ["orbit", 4.0], ["diameter", 4.0], ["mass", 5.0], ["moons", 7]]
---
  def create
    Planet.create(
      name: params[:name],
      image: params[:image],
      orbit: params[:orbit],
      diameter: params[:diameter],
      mass: params[:mass],
      moons: params[:moons]
    )

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    # Because of the '/planets/:id' route, we get access to the ID used in the URL in the params variable; so if the URL was /planets/25, the variable params[:id] will contain the string '25'
   @planet = Planet.find(params[:id])

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit

    @planet = Planet.find (params[:id])

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "planets" SET "orbit" = ? WHERE "planets"."id" = ?  [["orbit", 3.0], ["id", 9]]
---
  def update

  planet = Planet.find (params[:id])
    planet.update(
      name: params[:name],
      image: params[:image],
      orbit: params[:orbit],
      diameter: params[:diameter],
      mass: params[:mass],
      moons: params[:moons]
    )

DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 8]]
---
  def destroy

    Planet.destroy params[:id]